# 练习：
# 得到如下字符串中有几个字符
#     1） ‘abcd1234’
#     2）‘5\’4“’
#     3）\"\x34\056'‘
#     4) '\a\b\c\d'
#     5)'\n\t\r\\'
# print(len(1))
# 练习：
#     写一个程序，打印一个高度为4行的矩形方框
#     如：
#         请输入方框的宽度：10
#         打印如下：
#         **********
#         *        *
#         *        *
#         **********
# # 注：宽度为输入数字的个数*号
# a =int(input("请输入框型方框的宽度"))
# print("*"*a)
# print("*",' '*(a-2),"*",sep='')
# print("*",' '*(a-2),"*",sep='')
# print("*"*a)
#
# a =int(input("请输入框型方框的宽度"))
# line1='*'*a
# line2=('*'+' '*(a-2)+'*')
# print(line1)
# print(line2)
# print(line2)
# print(line1）
#
# 练习:
#     写一个程序，任意输入一段字符串，判断你的名字是否在这个字符串中，如果存在则打印’您的名字出现了‘否则不予理睬
# x ="福建省客服及时打开附件啊手机打开附件是快递费杜小勇大家撒地方就卡死的肌肤克鲁赛德"
# name = input("请输入你的名字")
# if '杜小勇' in x:
#     print("您的名字出现了！")
# 练习：
#     写程序，输入一行字符串，打印出如下内容：
#     1）打印这个字符串的第一个字符
#     2）打印这个字符串的最后一个字符
#     3）如果这个字符串的长度是奇数，打印中间这个字符
# s =input("请输入一行字符串")
# print(s[0])
# print(s[-1])
# if len(s)%2==1:
#     print(s[len(s)//2])
# 练习
#     1.写入一个程序，输入一个字符串，把字符串的第一个字符和最后一个字符去掉后，打印出来处理的字符串
#     2.输入任意一个字符串，判断这个字符串是否回文
#     回文示例：
#         上海自来水来自海上
#         abccba
#         回文诗指中文对称的文字
# s = input("请输入一个字符串")
# m = len(s)-1
# a = s[1:m]
# print(a)
# a =input("输入一个字符串")
#
# d=a[::-1]
# if a==d:
#     print("是回文")
# else:
#     print("不是回文")
# 练习：
#     1.写一个程序，输入一个字符串，如果字符串不为空，则把这个字符串的第一个字符的编码打印出来
#     2.写一个程序，输入一个整数值（0~65535之间的整数），打印出来这个数值所对应的字符
# a =input("请输入一个字符串")
# b =a[0]
# c= ord(b)
# if  a:
#     print(c)
# a=int(input("输入一个整数"))
# b = chr(a)
# if 0 < a < 65535:
#     print(b)

# 练习：
#     1.用字符串　＊　运算符打印三角形
#         要求输入一个数，此整数代表此三角形离左侧的字符个数
#         如：
#         请输入左侧的空格数：３
#            *
#           ***
#          *****
#         *******
#     2.输入一个字符串，把输入的字符串中的空格全部去掉
#     打印出处理之后的字符串的内容
#
#     3.输入三行文字，让这三行文字在一个方框内居中显示
#       如：（请不要输入中文）：
#         请输入第1行：　hello!
#         请输入第2行：　I'm studing python!
#         请输入第3行：　I like python!
#         打印如下：
#         +------------------------+
#         |        hello!          |
#         |   I'm studing python!  |
#         |      I like python!    ｜
#         +------------------------+
# 1.
# k =int(input("请输入左侧空格数"))
# print(" "*k+"    *")
# print(" "*k+"   ***")
# print(" "*k+ " ******")
# print(" "*k+"********")
# 2.
# a =input("输入一个字符串")
# pring(a.replace(" ",""))

# 3.
# a =input("请输入第一行")
# b =input("请输入第二行")
# c = input ("请输入第三行")
# d = max(len(a),len(b),len(c))
# print("+"+"-"*(d)+"+")
# print("|"+a.center(d)+"|")
# print("|"+b.center(d)+"|")
# print("|"+c.center(d)+"|")
# # print("+"+"-"*(d)+"+")
# pi=3.14
# i=int(pi)
# f=pi-i
# print(f)
# a=int(input("任意输入一个数字"))
# if a>100:
#     print(a,"这个数字大于100")
# elif a<0:
#     print(a,"这个数字小于0")
# elif 50<a<100:
#     print(a,"这个数字在50~100之间")
# else:
#     print(a,"这个数字不在以上范围内")

# a=int(input("输入一个整数"))
# if 0<=a:
#     print(a)
# else:
#     print(-a)
# n=int(input("请输入公里数"))
# if n<=3:
#     print("费用为:",13,"元")
# elif 3<n<=15:
#     print("费用为：",13+(n-3)*2.3,"元")
# elif n>15:
#     print("费用为：",13+12*2.3+3.45*(15-n),"元")
# a=int(input("输入一个任意数"))
# b=int(input("输入一个任意数"))
# c=int(input("输入一个任意数"))
# m=max(a,b,c)
# print("最大数为：",m)
# n=min(a,b,c)
# print("最小数为：",n)
# s=(a+b+c)/3
# print("三个数的平均值是",s)
# s=float(input("请输入身高（m）"))
# t=float(input("请输入体重（kg）"))
# B=t/(s**2)
# if B<18.5:
#     print("BMI为：",B,"体重过轻")
# elif 18.5<=B<=24:
#     print("BMI为：",B,"体重正常")
# else:
#     print("BMI为：",B,"体重过重")


